const mongoose = require('mongoose');
const {Location} = require('../models/locations');


module.exports = () => {
    Location.aggregate([
        {
            $count: "count"
        }
    ]).then(res => {
        if (res.length === 0) {
            console.log("no locations detected. Adding now...")
            Location.insertMany([
                {name: "Αχαρνές"},
                {name: "Αγία Παρασκευή"},
                {name: "Αγία Βαρβάρα"},
                {name: "Άγιοι Ανάργυροι-Καματερό"},
                {name: "Άγιος Δημήτριος"},
                {name: "Αιγάλεω"},
                {name: "Άλιμος"},
                {name: "Αγκίστρι"},
                {name: "Ασπρόπυργος"},
                {name: "Αθήνα"},
                {name: "Χαϊδάρι"},
                {name: "Χαλάνδρι"},
                {name: "Κύθηρα"},
                {name: "Δάφνη-Υμηττός"},
                {name: "Διόνυσος"},
                {name: "Αίγινα"},
                {name: "Ελευσίνα"},
                {name: "Ελληνικό-Αργυρούπολη"},
                {name: "Φιλοθέη-Ψυχικό"},
                {name: "Φυλή"},
                {name: "Γαλάτσι"},
                {name: "Γλυφάδα"},
                {name: "Ηλιούπολη"},
                {name: "Ηράκλειο"},
                {name: "Ύδρα"},
                {name: "Ίλιο"},
                {name: "Καλλιθέα"},
                {name: "Κερατσίνι-Δραπετσώνα"},
                {name: "Καισαριανή"},
                {name: "Κηφισιά"},
                {name: "Κωρωπί"},
                {name: "Κορυδαλλός"},
                {name: "Λαύριο"},
                {name: "Πειραιάς"},
                {name: "Λυκόβρυση-Πεύκη"},
                {name: "Μάνδρα-Ειδυλλία"},
                {name: "Μαραθώνα"},
                {name: "Μαρκόπουλο Μεσογαίας"},
                {name: "Μαρούσι"},
                {name: "Μέγαρα"},
                {name: "Μεταμόρφωση"},
                {name: "Μοσχάτο-Ταύρος"},
                {name: "Νέα Ιωνία"},
                {name: "Νέα Σμύρνης"},
                {name: "Νίκαια-Άγιος Ιωάννης Ρέντης"},
                {name: "Ωρωπός"},
                {name: "Παλαιό Φάληρο"},
                {name: "Παλλήνη"},
                {name: "Παπάγος-Χολαργός"},
                {name: "Παιανία"},
                {name: "Πεντέλη"},
                {name: "Πέραμα"},
                {name: "Περιστέρι"},
                {name: "Πετρούπολη"},
                {name: "Φιλαδέλφεια-Χαλκηδόνα"},
                {name: "Πόρος"},
                {name: "Ραφήνα-Πικέρμι"},
                {name: "Σαλαμίνα"},
                {name: "Σαρωνικός"},
                {name: "Σπάτα-Άρτεμις"},
                {name: "Σπέτσες"},
                {name: "Τροιζηνία"},
                {name: "Βάρη-Βούλα-Βουλιαγμένη"},
                {name: "Βριλήσσια"},
                {name: "Βύρωνας"},
                {name: "Ζωγράφου"}
            ]).then(res=>console.log('locations added'));
        }
    });
};